tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "thezoraiz/ascii-image-converter"
brew "bash"
brew "btop"
brew "cloc"
brew "cmake"
brew "cowsay"
brew "docker"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "ghc"
brew "lazygit"
brew "tree-sitter"
brew "neovim"
brew "neovide"
brew "ninja"
brew "node"
brew "pnpm"
brew "ripgrep"
brew "rust-analyzer"
brew "rustup"
brew "starship"
brew "tldr"
brew "tree-sitter-cli"
brew "uv"
brew "yazi"
brew "felixkratz/formulae/borders"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
cask "font-hack-nerd-font"
cask "kitty"
cask "mos"
